FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/instance/instance_pwm0.h
    #define REG_PWM0_CMPV5       ( *( __IO uint32_t * ) 0x40020180U ) /**< \brief (PWM0) PWM Comparison 5 Value Register */
    #define REG_PWM0_CMPVUPD5    ( *( __O uint32_t * ) 0x40020184U )  /**< \brief (PWM0) PWM Comparison 5 Value Update Register */
    #define REG_PWM0_CMPM5       ( *( __IO uint32_t * ) 0x40020188U ) /**< \brief (PWM0) PWM Comparison 5 Mode Register */
    #define REG_PWM0_CMPMUPD5    ( *( __O uint32_t * ) 0x4002018CU )  /**< \brief (PWM0) PWM Comparison 5 Mode Update Register */
    #define REG_PWM0_CMPV6       ( *( __IO uint32_t * ) 0x40020190U ) /**< \brief (PWM0) PWM Comparison 6 Value Register */
    #define REG_PWM0_CMPVUPD6    ( *( __O uint32_t * ) 0x40020194U )  /**< \brief (PWM0) PWM Comparison 6 Value Update Register */
    #define REG_PWM0_CMPM6       ( *( __IO uint32_t * ) 0x40020198U ) /**< \brief (PWM0) PWM Comparison 6 Mode Register */
    #define REG_PWM0_CMPMUPD6    ( *( __O uint32_t * ) 0x4002019CU )  /**< \brief (PWM0) PWM Comparison 6 Mode Update Register */
    #define REG_PWM0_CMPV7       ( *( __IO uint32_t * ) 0x400201A0U ) /**< \brief (PWM0) PWM Comparison 7 Value Register */
    #define REG_PWM0_CMPVUPD7    ( *( __O uint32_t * ) 0x400201A4U )  /**< \brief (PWM0) PWM Comparison 7 Value Update Register */
    #define REG_PWM0_CMPM7       ( *( __IO uint32_t * ) 0x400201A8U ) /**< \brief (PWM0) PWM Comparison 7 Mode Register */
    #define REG_PWM0_CMPMUPD7    ( *( __O uint32_t * ) 0x400201ACU )  /**< \brief (PWM0) PWM Comparison 7 Mode Update Register */
    #define REG_PWM0_CMR0        ( *( __IO uint32_t * ) 0x40020200U ) /**< \brief (PWM0) PWM Channel Mode Register (ch_num = 0) */
    #define REG_PWM0_CDTY0       ( *( __IO uint32_t * ) 0x40020204U ) /**< \brief (PWM0) PWM Channel Duty Cycle Register (ch_num = 0) */
    #define REG_PWM0_CDTYUPD0    ( *( __O uint32_t * ) 0x40020208U )  /**< \brief (PWM0) PWM Channel Duty Cycle Update Register (ch_num = 0) */
    #define REG_PWM0_CPRD0       ( *( __IO uint32_t * ) 0x4002020CU ) /**< \brief (PWM0) PWM Channel Period Register (ch_num = 0) */
    #define REG_PWM0_CPRDUPD0    ( *( __O uint32_t * ) 0x40020210U )  /**< \brief (PWM0) PWM Channel Period Update Register (ch_num = 0) */
    #define REG_PWM0_CCNT0       ( *( __I uint32_t * ) 0x40020214U )  /**< \brief (PWM0) PWM Channel Counter Register (ch_num = 0) */
    #define REG_PWM0_DT0         ( *( __IO uint32_t * ) 0x40020218U ) /**< \brief (PWM0) PWM Channel Dead Time Register (ch_num = 0) */
    #define REG_PWM0_DTUPD0      ( *( __O uint32_t * ) 0x4002021CU )  /**< \brief (PWM0) PWM Channel Dead Time Update Register (ch_num = 0) */
    #define REG_PWM0_CMR1        ( *( __IO uint32_t * ) 0x40020220U ) /**< \brief (PWM0) PWM Channel Mode Register (ch_num = 1) */
    #define REG_PWM0_CDTY1       ( *( __IO uint32_t * ) 0x40020224U ) /**< \brief (PWM0) PWM Channel Duty Cycle Register (ch_num = 1) */
    #define REG_PWM0_CDTYUPD1    ( *( __O uint32_t * ) 0x40020228U )  /**< \brief (PWM0) PWM Channel Duty Cycle Update Register (ch_num = 1) */
    #define REG_PWM0_CPRD1       ( *( __IO uint32_t * ) 0x4002022CU ) /**< \brief (PWM0) PWM Channel Period Register (ch_num = 1) */
    #define REG_PWM0_CPRDUPD1    ( *( __O uint32_t * ) 0x40020230U )  /**< \brief (PWM0) PWM Channel Period Update Register (ch_num = 1) */
    #define REG_PWM0_CCNT1       ( *( __I uint32_t * ) 0x40020234U )  /**< \brief (PWM0) PWM Channel Counter Register (ch_num = 1) */
    #define REG_PWM0_DT1         ( *( __IO uint32_t * ) 0x40020238U ) /**< \brief (PWM0) PWM Channel Dead Time Register (ch_num = 1) */
    #define REG_PWM0_DTUPD1      ( *( __O uint32_t * ) 0x4002023CU )  /**< \brief (PWM0) PWM Channel Dead Time Update Register (ch_num = 1) */
    #define REG_PWM0_CMR2        ( *( __IO uint32_t * ) 0x40020240U ) /**< \brief (PWM0) PWM Channel Mode Register (ch_num = 2) */
    #define REG_PWM0_CDTY2       ( *( __IO uint32_t * ) 0x40020244U ) /**< \brief (PWM0) PWM Channel Duty Cycle Register (ch_num = 2) */
    #define REG_PWM0_CDTYUPD2    ( *( __O uint32_t * ) 0x40020248U )  /**< \brief (PWM0) PWM Channel Duty Cycle Update Register (ch_num = 2) */
    #define REG_PWM0_CPRD2       ( *( __IO uint32_t * ) 0x4002024CU ) /**< \brief (PWM0) PWM Channel Period Register (ch_num = 2) */
    #define REG_PWM0_CPRDUPD2    ( *( __O uint32_t * ) 0x40020250U )  /**< \brief (PWM0) PWM Channel Period Update Register (ch_num = 2) */
    #define REG_PWM0_CCNT2       ( *( __I uint32_t * ) 0x40020254U )  /**< \brief (PWM0) PWM Channel Counter Register (ch_num = 2) */
    #define REG_PWM0_DT2         ( *( __IO uint32_t * ) 0x40020258U ) /**< \brief (PWM0) PWM Channel Dead Time Register (ch_num = 2) */
    #define REG_PWM0_DTUPD2      ( *( __O uint32_t * ) 0x4002025CU )  /**< \brief (PWM0) PWM Channel Dead Time Update Register (ch_num = 2) */
    #define REG_PWM0_CMR3        ( *( __IO uint32_t * ) 0x40020260U ) /**< \brief (PWM0) PWM Channel Mode Register (ch_num = 3) */
    #define REG_PWM0_CDTY3       ( *( __IO uint32_t * ) 0x40020264U ) /**< \brief (PWM0) PWM Channel Duty Cycle Register (ch_num = 3) */
    #define REG_PWM0_CDTYUPD3    ( *( __O uint32_t * ) 0x40020268U )  /**< \brief (PWM0) PWM Channel Duty Cycle Update Register (ch_num = 3) */
    #define REG_PWM0_CPRD3       ( *( __IO uint32_t * ) 0x4002026CU ) /**< \brief (PWM0) PWM Channel Period Register (ch_num = 3) */
    #define REG_PWM0_CPRDUPD3    ( *( __O uint32_t * ) 0x40020270U )  /**< \brief (PWM0) PWM Channel Period Update Register (ch_num = 3) */
    #define REG_PWM0_CCNT3       ( *( __I uint32_t * ) 0x40020274U )  /**< \brief (PWM0) PWM Channel Counter Register (ch_num = 3) */
    #define REG_PWM0_DT3         ( *( __IO uint32_t * ) 0x40020278U ) /**< \brief (PWM0) PWM Channel Dead Time Register (ch_num = 3) */
    #define REG_PWM0_DTUPD3      ( *( __O uint32_t * ) 0x4002027CU )  /**< \brief (PWM0) PWM Channel Dead Time Update Register (ch_num = 3) */
    #define REG_PWM0_CMUPD0      ( *( __O uint32_t * ) 0x40020400U )  /**< \brief (PWM0) PWM Channel Mode Update Register (ch_num = 0) */
    #define REG_PWM0_CMUPD1      ( *( __O uint32_t * ) 0x40020420U )  /**< \brief (PWM0) PWM Channel Mode Update Register (ch_num = 1) */
    #define REG_PWM0_ETRG1       ( *( __IO uint32_t * ) 0x4002042CU ) /**< \brief (PWM0) PWM External Trigger Register (trg_num = 1) */
    #define REG_PWM0_LEBR1       ( *( __IO uint32_t * ) 0x40020430U ) /**< \brief (PWM0) PWM Leading-Edge Blanking Register (trg_num = 1) */
    #define REG_PWM0_CMUPD2      ( *( __O uint32_t * ) 0x40020440U )  /**< \brief (PWM0) PWM Channel Mode Update Register (ch_num = 2) */
    #define REG_PWM0_ETRG2       ( *( __IO uint32_t * ) 0x4002044CU ) /**< \brief (PWM0) PWM External Trigger Register (trg_num = 2) */
    #define REG_PWM0_LEBR2       ( *( __IO uint32_t * ) 0x40020450U ) /**< \brief (PWM0) PWM Leading-Edge Blanking Register (trg_num = 2) */
    #define REG_PWM0_CMUPD3      ( *( __O uint32_t * ) 0x40020460U )  /**< \brief (PWM0) PWM Channel Mode Update Register (ch_num = 3) */
    #define REG_PWM0_ETRG3       ( *( __IO uint32_t * ) 0x4002046CU ) /**< \brief (PWM0) PWM External Trigger Register (trg_num = 3) */
    #define REG_PWM0_LEBR3       ( *( __IO uint32_t * ) 0x40020470U ) /**< \brief (PWM0) PWM Leading-Edge Blanking Register (trg_num = 3) */
    #define REG_PWM0_ETRG4       ( *( __IO uint32_t * ) 0x4002048CU ) /**< \brief (PWM0) PWM External Trigger Register (trg_num = 4) */
    #define REG_PWM0_LEBR4       ( *( __IO uint32_t * ) 0x40020490U ) /**< \brief (PWM0) PWM Leading-Edge Blanking Register (trg_num = 4) */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* _SAMV71_PWM0_INSTANCE_ */
